#Оголшуємо функцію для перевірки симетрії дужок у виразі, 
def check (expr):
    stack = []
    # створюємо словник для закриваючих і відкриваючих дужок
    pairs = {')': '(', ']': '[', '}': '{'}
    # За допомогою стека перевіряємо кожен символ у виразі
    for char in expr:
    # Якщо це символ відкриваючої дужки, додаємо його до стека    
        if char in '([{':
            stack.append(char)
        # Якщо це символ закриваючої дужки, перевіряємо відповідність з останньою відкриваючою дужкою у стеці
        elif char in ')]}':
            if not stack or stack[-1] != pairs[char]:
                # Повертаємо "Несиметрично" — дужки не співпали чи немає пари
                return "Несиметрично"
            # Видаляємо останню відкриту дужку зі стеку (знайшли пару)
            stack.pop()
    # Симетрично, якщо стек порожній. Якщо всі дужки закриті правильно — повертаємо "Симетрично", інакше — "Несиметрично"
    return "Симетрично" if not stack else "Несиметрично"

# Приклади використання:
print(check ("( ){[ 1 ]( 1 + 3 )( ){ }}"))    
print(check ("( 23 ( 2 - 3);)"))            
print(check ("({ 11 }")) 